txt_instruction = '''
Данное приложение позволит вам с помощью теста Руфье
провести первичную диагностику вашего здоровья.

Проба Руфье представляет собой нагрузочный комплекс,
предназначенный для оценки работоспособности сердца.

Сначала измеряется пульс за 15 секунд.

Затем за 45 секунд выполняется 30 приседаний.

После нагрузки снова измеряется пульс.
'''

txt_test1 = '''
Замерьте пульс за 15 секунд.

Введите результат.
'''

txt_test2 = '''
Выполните 30 приседаний за 45 секунд.
'''

txt_test3 = '''
В течение минуты измерьте пульс два раза:

за первые 15 секунд
за последние 15 секунд
'''

txt_sits = "Выполните 30 приседаний за 45 секунд."
