'''
👨‍💻 Практика №1 — рейтинг игроков

В игре есть результаты пяти игроков. Добавьте нового игрока с 1000 очками,
удалите последний результат, а затем покажите рейтинг по убыванию.
'''

scores = [450, 120, 780, 300, 600]

# 1. Добавить 1000
# 2. Удалить последний элемент
# 3. Отсортировать по убыванию
# 4. Вывести список







'''
👨‍💻 Практика №2 — секретный портал
'''

portal = (150, 70, -250)

# Выведите координату X
# Выведите координату Z
# Выведите количество координат








'''
👨‍💻 Практика №3 — магазин Roblox
Представьте, что вы разрабатываете магазин игровых предметов.
'''

shop = {
    "sword": 500,
    "shield": 300,
    "potion": 100
}

# 1. Выведите цену меча
# 2. Измените цену щита на 250
# 3. Добавьте новый предмет bow за 400
# 4. Удалите potion
# 5. Выведите обновлённый магазин
