# numbers = [10, 20, 30] # -> список
#
# numbers = (10, 20, 30) # -> кортеж


'''Список можно изменять'''
# numbers = [10, 20, 30]
# numbers[0] = 100
# print(numbers)

'''Кортеж менять нельзя'''
# numbers = (10, 20, 30)
# numbers[0] = 100
# print(numbers)





# ================ СЛОВАРЬ ==================

# name = "Али"
# age = 15
# city = "Казань"

"""Словарь хранит данные по принципу <ключ - значение> - пара"""
student = {
    "name": 'Али',
    "age": 15,
    "city": "Казань"
}

print(student['name'])

# Добавить новую пару
student['school'] = 'Школа №10'
print(student)
